Public Attributes | List of all members
API_RailingQuantity Struct Reference
Element Manager API
Calculated values for a railing. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | area
The area of the railing.
double  | volume
The volume of the given railing.
double  | length3D
The length of the 3D reference line of the railing.
Detailed Description
Calculated values for a railing.
Member Data Documentation
◆ area
 API_RailingQuantity::area
The area of the railing.
◆ length3D
 API_RailingQuantity::length3D
The length of the 3D reference line of the railing.
◆ volume
 API_RailingQuantity::volume
The volume of the given railing.